# # Строки
# s1 = "Мария"
# s2 = "Коляко"
# многострочная строка
# # s3 = """
# # Мария
# # Коляко
# # """
# # print(s3)
# другой способ переноса строки
# s4 = "Мария\nКоляко"
# print(s4[::-1])
# # print(s4)
# # пустая строка
# s5 = " "
# # print(s5)
# конкатинация - это объединение 2-х или несколько строк
# a = 4
# # s6 = s1 + " " + s2 + str(a)
# # s7 = (s1 + " ") * 3
# # print(s7)
# узнать длину строки
# # s8 = len(s2)
# s9 = len(s5)
# # print(s9)
# Вхождение строки одну в одной true or false
# # print(s1 in s4)
# # print(s1 in s2)
# # print("ляко" in s2)
# Сравнение строк true or false
# # print("Мария" == s1)
# # print("Мария" == s4)
# Сравнение строк по алфавиту true or false
# # a = "абвг"
# # b = "авг"
# # print(a > b)
# Проверить каждую букву
# # a = "аб"
# # b = "ав"
# # print(ord("a"))
# # print(ord("б"))
# # print(ord("в"))
# # print(a < b)
# Превратить строку в число
# # a = "1234"
# # print(type(int(a)))
