"""
int - Целочисленные
"""
# a = 0
# b = 88889900
# c = -3
# d = -234554564

"""
float - Вещественные
"""
# a1 = 1.3
# b1 = 5.458789
# c1 = -7.43
# d1 = - 6.90809

""" 
Арифметические операции 
"""
# a = 2 + 5
# a = 2 + 3.5

# a = 8/2 всегда возвращает вещественное число
# b = 3/6
# print(a)
# print(type(a))
# print(b)
"""
Округление деление без остака
"""
a = 7 // 2
print(a)
"""
Деление - остаток от деления
"""
# a = 10 % 3
# a = 123 % 10
# print(a)
"""
Деление отрицательных чисел
"""
# a = 4 * 2
# print(a)
"""
Возведение в степь
"""
# a = 2 ** 3 # 2 * 2 * 2
# print(a)

# a = 2 + 3 * 5
# print(a)

a = 1
# a = a + 1
# a += 1 # так проще
a -= 1
# a /= 10
# print(a)

