""" в виде табличке """
# a = 12
# b = 34
# c = 56
# print(a, b, c, sep=" | ", end=" ")
# print(a, b, c, sep=" | ")

""" Вывести в красивом тексте """
# print("Результат умножения числа", a, "и числа", b, "равен", a * b)

""" но можно проще"""
# print(f"Результат умножения числа {a} и числа {b} равен {a * b}") # f -

""" Функция input """ # если вводить цифры все равно будет строка
# a = input()
# print(a)
# print(type(a))
""" как преобразовать в число """
# a = int(input())
# print(a)
# print(type(a))

""" как преобразовать в вещественое число"""
# a = float(input())
# print(a)
# print(type(a))

""" как вывести несколько чисел"""
# a = float(input("введите длину прямоугольника: "))
# b = float(input("введите ширину прямоугольника: "))
# print(f"Периметр: {2 * (a * b)}")

# world = "Helloworld"
# print(world, end=" ")