""" Условный оператор позволяет выполнять код при определенных условия"""
# x = -6 # если число отрицательно, то мы делаем его положительным
# if x < 0:
#     x = -x
# print(x)

# поменять числа местами
# a = int(input("Введите число: "))
# b = int(input("Введите число: "))

# например хотим, чтобы число a всегда было больше b
# print('До IF', a, b)
# if a < b:
#     a, b = b, a
# print('После IF', a, b)

# дополнительно можем использовать and и or
# x = -3
# if x < -2 and x != 0:
#     print("Число входит в диапазон")
#
# x = -2
# if x < -1 and x != 0:
#     print("Число входит в диапазон")

# x = True
# if x:
#     print("Число входит в диапазон")

# входит ли в диапазон
# ages = [23, 65, 83]
# age_1 = 23
# age_2 = 24

# if age_2 in ages:
#     print("Да, у тебя верный возраст")
# else:
#     print("Нет, у тебя не верный возраст")

# проверка на отрицательность

# x = int(input("Введите число: "))
# if x < 0:
#     print("Отрицательное число")
# else:
#     print("Положительное число")

# Проверить на четность и не четность

# if x % 2 == 0: # делится без остатка
#     print("Четное число")
# else:
#     print("Нечетное число")

